app/controllers/terms_controller.rb

SELECT * FROM "terms"
---
  def index
    @terms = Term.all

SELECT * FROM "terms" WHERE ("terms"."id" = 1)
---
  def show
    @term = Term.find(params[:id])

SELECT * FROM "terms" WHERE ("terms"."id" = 7)
---
  def edit
    @term = Term.find(params[:id])

INSERT INTO "terms" ("created_at", "threshold", "term", "updated_at") VALUES('2010-06-09 19:29:24', 0.03, 'glee', '2010-06-09 19:29:24')
---
  def create
    @term = Term.new(params[:term])

    respond_to do |format|
      if @term.save

SELECT * FROM "terms" WHERE ("terms"."id" = 7)
UPDATE "terms" SET "updated_at" = '2010-06-09 21:39:13', "threshold" = 99.99 WHERE "id" = 7
---
  def update
    @term = Term.find(params[:id])

    respond_to do |format|
      if @term.update_attributes(params[:term])

SELECT * FROM "terms" WHERE ("terms"."id" = 1)
DELETE FROM "terms" WHERE "id" = 1
---
  def destroy
    @term = Term.find(params[:id])
    @term.destroy