app/controllers/term_counts_controller.rb

SELECT * FROM "term_counts"
---
  def index
    @term_counts = TermCount.all

SELECT * FROM "term_counts" WHERE ("term_counts"."id" = 34)
---
  def show
    @term_count = TermCount.find(params[:id])